# St7GetLBAShift

Returns the load factor shift to be used in linear buckling analysis. The closest modes found, both above and
below the shift value, will be calculated.

Solver – Linear Buckling

long St7GetLBAShift(long uID, double* Shift)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

Shift

Load factor shift.

Strand7 API Manual

Solver – Load Influence